Oamains/GD32F4xx/User/main.c
/*!
    \file    main.c
    \brief   led spark with systick

    \version 2016-08-15, V1.0.0, firmware for GD32F4xx
    \version 2018-12-12, V2.0.0, firmware for GD32F4xx
    \version 2020-09-30, V2.1.0, firmware for GD32F4xx
    \version 2022-03-09, V3.0.0, firmware for GD32F4xx
*/

/*
    Copyright (c) 2022, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include <string.h>
#include "systick.h"
#include "gd32f4xx_misc.h"
#include "main.h"
#include "led.h"
#include "game_usart.h"
#include "led_key.h"
#include "timer_led.h"
#include "pwm_led.h"
#include "led_light_flow.h"
#include "lcd.h"
#include "image1.h"
#include "image2lcd.h"

/*!
    \brief    main function
    \param[in]  none
    \param[out] none
    \retval     none
*/
int main(void) {
    systick_config();
    nvic_priority_group_set(NVIC_PRIGROUP_PRE2_SUB2);
    Key_Nvic_Key_Init();
    Usart_Send_Init(115200U);
    LCD_Init();
    uint8_t x = 0;
    while (1) {
#if 1
        switch (x) {

            case 1:
                LCD_Clear(WHITE);
                break;
            case 2:
                LCD_Clear(BLACK);
                break;
            case 3:
                LCD_Clear(RED);
                break;
            case 4:
                LCD_Clear(GREEN);
                break;
            case 5:
                LCD_Clear(BLUE);
                break;
            case 6:
                image_display(10, 20, (uint8_t *) gImage_logo);
                break;
            case 7:
                image_display(10, 120, (uint8_t *) gImage_rou);
                break;
            case 8:
                image_display(10, 220, (uint8_t *) gImage_qingcai);
                break;
        }
#endif
        POINT_COLOR = RED;
        LCD_ShowString(30, 70, 200, 16, 16, "TFTLCD TEST");
        LCD_ShowString(30, 90, 200, 16, 16, "WWW.51TFT.COM");
        LCD_ShowString(30, 110, 200, 16, 16, "2017/9/5");
        x++;
        if (x == 9)x = 0;
        delay_1ms(100);
    }
}
